Mathieug83/lecteur-MP3-STM32F746/mp3-stm32/Core/Src/main.c
  /*Configure GPIO pins : LED14_Pin LED15_Pin */
  GPIO_InitStruct.Pin = LED14_Pin|LED15_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_VBUS_Pin */
  GPIO_InitStruct.Pin = OTG_FS_VBUS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_VBUS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Audio_INT_Pin */
  GPIO_InitStruct.Pin = Audio_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(Audio_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : OTG_FS_PowerSwitchOn_Pin LED16_Pin */
  GPIO_InitStruct.Pin = OTG_FS_PowerSwitchOn_Pin|LED16_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : LED3_Pin LCD_DISP_Pin */
  GPIO_InitStruct.Pin = LED3_Pin|LCD_DISP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  /*Configure GPIO pin : uSD_Detect_Pin */
  GPIO_InitStruct.Pin = uSD_Detect_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(uSD_Detect_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_BL_CTRL_Pin */
  GPIO_InitStruct.Pin = LCD_BL_CTRL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pins : LED13_Pin LED17_Pin LED11_Pin LED12_Pin
                           LED2_Pin LED18_Pin */
  GPIO_InitStruct.Pin = LED13_Pin|LED17_Pin|LED11_Pin|LED12_Pin
                          |LED2_Pin|LED18_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : BP_JOYSTICK_Pin RMII_RXER_Pin */
  GPIO_InitStruct.Pin = BP_JOYSTICK_Pin|RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : EXT_RST_Pin */
  GPIO_InitStruct.Pin = EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EXT_RST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PA4 */
  GPIO_InitStruct.Pin = GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */

	/* Infinite Loop */
	for (;;) {
		osDelay(1);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_Interface_HM */
/**
 * @brief Function implementing the task_IHM thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_Interface_HM */
void Interface_HM(void const * argument)
{
  /* USER CODE BEGIN Interface_HM */
	TS_StateTypeDef TS_State;
	uint16_t MessageTS;

	/* Infinite loop */
	for (;;) {
		osDelay(300); //Période de 200ms
		BSP_TS_GetState(&TS_State);
		if (TS_State.touchDetected) {
			HAL_GPIO_TogglePin(LED12_GPIO_Port, LED12_Pin);
			MessageTS = TS_State.touchX[0];
			xQueueSend(QueueTS2PICHandle, &MessageTS, 0);
		}
	}
  /* USER CODE END Interface_HM */
}

/* USER CODE BEGIN Header_Affichage_Pic */
/**
 * @brief Function implementing the task_Affich_Pic thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_Affichage_Pic */
void Affichage_Pic(void const * argument)
{
  /* USER CODE BEGIN Affichage_Pic */
    uint32_t counter = 0;
    uint16_t MessageFromIHM;
    uint8_t action;
    const TickType_t Delai_Atttente = 5000;
    char text[50] = {};

    BSP_LCD_Clear(LCD_COLOR_BLACK);
    BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);

    /* Initialisation de la carte SD et chargement des metadonnees */
    if (FATFS_LinkDriver(&SD_Driver, SDPath) == 0) {
        if (MP3_Storage_Init() != 0 || MP3_Storage_LoadAllMetadata("/") == 0) {
    		sprintf(text, "Erreur init ou aucun fichier MP3  %lu : %lu",MP3_Storage_Init(),MP3_Storage_LoadAllMetadata("/"));
    		BSP_LCD_DisplayStringAtLine(5, (uint8_t*) text);
            while (1);
        }
    } else {
        Error_Handler();
    }
	/* Infinite loop */
	for (;;) {
        osDelay(200);
        BSP_LCD_Clear(LCD_COLOR_BLACK);

        MP3FileInfo* file = mp3Infos[counter];

        // Affichage du nom du fichier courant
        BSP_LCD_DisplayStringAtLine(0, (uint8_t*)"Fichier:");
        BSP_LCD_DisplayStringAtLine(1, (uint8_t*)file->filename);

        // Affichage des metadonnees selon le type de tag present
        if (file->tagV1) {
            BSP_LCD_DisplayStringAtLine(3, (uint8_t*)"Titre:");
            BSP_LCD_DisplayStringAtLine(4, (uint8_t*)file->tagV1->title);
            BSP_LCD_DisplayStringAtLine(5, (uint8_t*)"Artiste:");
            BSP_LCD_DisplayStringAtLine(6, (uint8_t*)file->tagV1->artist);
        } else if (file->tagV2) {
            BSP_LCD_DisplayStringAtLine(3, (uint8_t*)"Titre:");
            BSP_LCD_DisplayStringAtLine(4, (uint8_t*)file->tagV2->title);
            BSP_LCD_DisplayStringAtLine(5, (uint8_t*)"Artiste:");
            BSP_LCD_DisplayStringAtLine(6, (uint8_t*)file->tagV2->artist);
        } else {
            BSP_LCD_DisplayStringAtLine(3, (uint8_t*)"Pas de metadonnees.");
        }

        // Gestion du changement de fichier via les boutons (tactile ou GPIO), de manière circulaire
        if (xQueueReceive(QueueBPHandle, &action, Delai_Atttente) == pdPASS) {
            if (action == 1) {
                counter = (counter == 0) ? mp3FileCount - 1 : counter - 1;
            } else if (action == 2) {
                counter = (counter + 1) % mp3FileCount;
            }
        }
	}
  /* USER CODE END Affichage_Pic */
}

/* USER CODE BEGIN Header_Demarrage */
/**
 * @brief Function implementing the task_Demarrage thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_Demarrage */
void Demarrage(void const * argument)
{
  /* USER CODE BEGIN Demarrage */
//	int etat_demarrage=0;
	/* Infinite loop */
	for (;;) {
//		if (etat_demarrage==0){
//			vTaskSuspend(task_Affich_PicHandle);
//
//	BSP_LCD_DrawBitmap(150, 80, Accueil_2_bmp); //Affichage écran d'accueil
//			etat_demarrage=1;
//			vTaskResume(task_Affich_PicHandle);
//		}
//		else{
//			etat_demarrage=1;
//		}
//		osDelay(1000);
		osDelay(100);
	}
  /* USER CODE END Demarrage */
}

/* USER CODE BEGIN Header_Bouton */
/**
* @brief Function implementing the task_Bouton thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Bouton */
void Bouton(void const * argument)
{
  /* USER CODE BEGIN Bouton */
    GPIO_PinState prev1 = GPIO_PIN_SET;
    GPIO_PinState prev2 = GPIO_PIN_SET;
  /* Infinite loop */
  for(;;)

  {
      GPIO_PinState curr1 = HAL_GPIO_ReadPin(BP1_GPIO_Port, BP1_Pin);
      GPIO_PinState curr2 = HAL_GPIO_ReadPin(BP2_GPIO_Port, BP2_Pin);

      if (prev1 == GPIO_PIN_SET && curr1 == GPIO_PIN_RESET) {
          uint8_t action = 1; // PRECEDENT
          xQueueSend(QueueBPHandle, &action, 0);
      }

